{
    "states": [
        {
            "description": "Talk to main hall receptionist", 
            "title": "Intro"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "Nobody in kitchen. Find everybody's meal orders. They all have Beef Wellington, apart from pablo who had Chicken Korma - what a wimp.", 
            "title": "Explore kitchen"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "CCTV shows James Bond in the lecture theatre.", 
            "title": "View CCTV"
        }, 
        {
            "requirements": [
                "View CCTV"
            ], 
            "description": "Bond explains that he was meeting the Queen. They had a conversation about Brexit. Apparently Buckingham Palace is getting renovated and they were discussing interior decorating.", 
            "title": "Question Bond"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "You find some catering notes lying around, on it is a note saying \"Dumbledore needs to speak to the chef\".", 
            "title": "Find catering notes"
        }, 
        {
            "requirements": [
                "View CCTV"
            ], 
            "description": "There are two sets of footprints where James Bond was in the CCTV. That's suspicious.", 
            "title": "Inspect lecture theatre"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "You meet Trump who says he heard non-famous voices coming from the balcony - is very worried he may have to talk to somebody with no influence.", 
            "title": "Inspect bin store"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "You find a wanted poster with a picture of Pablo on.", 
            "title": "Find wanted poster in bins"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "You find a ripped piece of Freddy Mercury's clothing.", 
            "title": "Find Mercury's clothing"
        }, 
        {
            "requirements": [
                "Explore kitchen"
            ], 
            "description": "Nobody is around. You find an epipen with \"Deliver in case of gluten ingestion\" written on the side.", 
            "title": "Inspect stairwell"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "Find Marilyn Monroe. She mentions that the queen has been the least talkative and quite emotionless and boring.", 
            "title": "Inspect common room"
        }, 
        {
            "requirements": [
                "Find Mercury's clothing"
            ], 
            "description": "Mercury says his ripped clothes were because he was dancing too hard.", 
            "title": "Talk to Mercury about clothing"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "You find a bloody dagger lying under a chair.", 
            "title": "Find a bloody dagger"
        }, 
        {
            "requirements": [
                "Find catering notes", 
                "Find Dumbledore's Cookbook"
            ], 
            "description": "Go to the balcony. Dumbledore says that he is an aspiring chef, he mentioned this to the receptionist who made a note to say that the chef should talk to him.", 
            "title": "Talk to Dumbledore about suspicions"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "Find a walkie talkie on the balcony inside a flower pot (or something inconspicuous).", 
            "title": "Inspect balcony"
        }, 
        {
            "requirements": [
                "Question Bond"
            ], 
            "description": "Talk to Queen and ask her where she was at time of death. She says she was with Bond talking about wallpapering.", 
            "title": "Inspect island"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "You find a small rune-bound book on the floor. Inside are some very exotic sounding recipes.", 
            "title": "Find Dumbledore's Cookbook"
        }, 
        {
            "requirements": [
                "Talk to Mercury about clothing"
            ], 
            "description": "Nobody is there but there's a montage of Freddy Mercury dancing his tits off.", 
            "title": "Inspect 360 room"
        }, 
        {
            "requirements": [
                "Find Mercury's clothing"
            ], 
            "description": "Ask the Queen what she thinks about Mercury's ripped clothes, she says she saw his clothes all in order before the murder...", 
            "title": "Talk to Queen about Mercury's clothes"
        }, 
        {
            "requirements": [
                "Intro"
            ], 
            "description": "Says that it's a shame about Pablo, says she had a long, deep conversation with him about all the wonderful things he did for the people of Columbia and for cocaine as an industry.", 
            "title": "Talk to Queen"
        }, 
        {
            "requirements": [
                "Inspect stairwell"
            ], 
            "description": "Ask them about the epipens. They explain he wanted a gluten-free meal, thought he was just a hipster.", 
            "title": "Talk to Receptionist about Dinner"
        }
    ], 
    "story_name": "SEPR Mystery 1"
}